In [1]:
import pandas as pd
import numpy as np

In [3]:
score = pd.DataFrame([[1,50,80,70], 
              [2,60,45,50],
              [3,98,43,55],
              [4,70,69,89],
              [5,56,79,60],
              [6,60,68,55],
              [7,45,70,77],
              [8,55,77,76],
              [9,25,57,60],
              [10,88,40,43]], columns = ['student_id', 'Math', 'English', 'Chinese'])
score = score.set_index('student_id')
score

            Math  English  Chinese
student_id
1             50       80       70
2             60       45       50
3             98       43       55
4             70       69       89
5             56       79       60
6             60       68       55
7             45       70       77
8             55       77       76
9             25       57       60
10            88       40       43

In [4]:
score.Math.mean()

60.7

In [5]:
score.mean()

Math       60.7
English    62.8
Chinese    63.5
dtype: float64

In [6]:
score.mean(axis = 1)

student_id
1     66.666667
2     51.666667
3     65.333333
4     76.000000
5     65.000000
6     61.000000
7     64.000000
8     69.333333
9     47.333333
10    57.000000
dtype: float64

In [8]:
score.sum(axis = 1)

student_id
1     200
2     155
3     196
4     228
5     195
6     183
7     192
8     208
9     142
10    171
dtype: int64

In [11]:
score.count()

Math       10
English    10
Chinese    10
dtype: int64

In [12]:
score.median()

Math       58.0
English    68.5
Chinese    60.0
dtype: float64

In [14]:
score.quantile(0.75)

Math       67.50
English    75.25
Chinese    74.50
Name: 0.75, dtype: float64

In [15]:
print(score.max())
print(score.min())

Math       98
English    80
Chinese    89
dtype: int64
Math       25
English    40
Chinese    43
dtype: int64

In [16]:
print(score.std())
print(score.var())

Math       20.854256
English    15.418603
Chinese    14.151953
dtype: float64
Math       434.900000
English    237.733333
Chinese    200.277778
dtype: float64

In [17]:
score.corr()

             Math   English   Chinese
Math     1.000000 -0.532708 -0.314552
English -0.532708  1.000000  0.682340
Chinese -0.314552  0.682340  1.000000

In [20]:
score.apply(lambda x : x**(0.5) *10 +3)

                  Math    English    Chinese
student_id
1            73.710678  92.442719  86.666003
2            80.459667  70.082039  73.710678
3           101.994949  68.574385  77.161985
4            86.666003  86.066239  97.339811
5            77.833148  91.881944  80.459667
6            80.459667  85.462113  77.161985
7            70.082039  86.666003  90.749644
8            77.161985  90.749644  90.177979
9            53.000000  78.498344  80.459667
10           96.808315  66.245553  68.574385

In [21]:
print(score.sum(axis = 1))
print(score.apply(sum, axis = 1))

student_id
1     200
2     155
3     196
4     228
5     195
6     183
7     192
8     208
9     142
10    171
dtype: int64
student_id
1     200
2     155
3     196
4     228
5     195
6     183
7     192
8     208
9     142
10    171
dtype: int64